chore(repo): remove non-linux source and tooling
